app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def edit
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 2)

  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save
---
INSERT INTO `movies` (`one_sheet_url`, `created_at`, `title`, `discription`, `updated_at`) VALUES(NULL, '2009-12-07 09:51:10', '', NULL, '2009-12-07 09:51:10')

  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 3)
UPDATE `movies` SET `updated_at` = '2009-12-07 12:02:19', `one_sheet_url` = '/image/img0709.jpg' WHERE `id` = 4

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)
DELETE FROM `movies` WHERE `id` = 1